package day9.homework;

public class CinobachiNumber {
    public static void main(String[] args) {
        //Выведите на экран первые 11 членов последовательности Фибоначчи.
        // первый и второй члены последовательности равны единицам
        // а каждый следующий —сумме двух предыдущих

        for (char i = 0; i <= 89; i++) {
            System.out.print(i + " ");

        }
    }
}
